phygeonet-master/case3/TemplateCase0.025/system/blockMeshDict
// Parametrized windTunnel

//Run using:
//m4 -P blockMeshDict.m4 > blockMeshDict

//m4 definitions:

//Mathematical constants:


//m4 spec:


//plane A settlingChamberInlet


//plane B contractionInlet


//plane C testSectionInlet


//plane D diffuserInlet


//plane E fanInlet


//plane F fanOutlet


//plane z:


//spline:


/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
	// front side
	(-0.5 -0.25 0) // Vertex A0 = 0 
	(0.5 -0.25 0) // Vertex B0 = 1 
	(0.5 0.25 0) // Vertex B1 = 2 
	(-0.5 0.25 0) // Vertex A1 = 3 

	// back side	
	(-0.5 -0.25 0.01) // Vertex A3 = 4 
	(0.5 -0.25 0.01) // Vertex B3 = 5 
	(0.5 0.25 0.01) // Vertex B2 = 6 
	(-0.5 0.25 0.01) // Vertex A2 = 7 

);

blocks          
(
    // stenosis domain	
    hex (0 1 2 3 4 5 6 7) (50 50 1) simpleGrading (1 1 1)
);

edges           
(
spline 0 3
(
(-4.984609773466514016e-01 -2.401960784313725561e-01 0.000000000000000000e+00)
(-4.969277927333821676e-01 -2.303921568627451122e-01 0.000000000000000000e+00)
(-4.954062620545857110e-01 -2.205882352941176405e-01 0.000000000000000000e+00)
(-4.939021569972905645e-01 -2.107843137254901966e-01 0.000000000000000000e+00)
(-4.924211831471739242e-01 -2.009803921568627527e-01 0.000000000000000000e+00)
(-4.909689583453211714e-01 -1.911764705882352811e-01 0.000000000000000000e+00)
(-4.895509913778304245e-01 -1.813725490196078372e-01 0.000000000000000000e+00)
(-4.881726610790997345e-01 -1.715686274509803932e-01 0.000000000000000000e+00)
(-4.868391959280661263e-01 -1.617647058823529493e-01 0.000000000000000000e+00)
(-4.855556542147937416e-01 -1.519607843137255054e-01 0.000000000000000000e+00)
(-4.843269048526473441e-01 -1.421568627450980338e-01 0.000000000000000000e+00)
(-4.831576089088360781e-01 -1.323529411764705899e-01 0.000000000000000000e+00)
(-4.820522019233889344e-01 -1.225490196078431460e-01 0.000000000000000000e+00)
(-4.810148770836323306e-01 -1.127450980392156743e-01 0.000000000000000000e+00)
(-4.800495693179940293e-01 -1.029411764705882304e-01 0.000000000000000000e+00)
(-4.791599403694720150e-01 -9.313725490196078649e-02 0.000000000000000000e+00)
(-4.783493649053890406e-01 -8.333333333333334259e-02 0.000000000000000000e+00)
(-4.776209177161234165e-01 -7.352941176470589868e-02 0.000000000000000000e+00)
(-4.769773620513761414e-01 -6.372549019607842702e-02 0.000000000000000000e+00)
(-4.764211391382180416e-01 -5.392156862745098311e-02 0.000000000000000000e+00)
(-4.759543589206794989e-01 -4.411764705882353921e-02 0.000000000000000000e+00)
(-4.755787920560100024e-01 -3.431372549019606755e-02 0.000000000000000000e+00)
(-4.752958631979685156e-01 -2.450980392156862364e-02 0.000000000000000000e+00)
(-4.751066455926241661e-01 -1.470588235294117974e-02 0.000000000000000000e+00)
(-4.750118570071658608e-01 -4.901960784313735831e-03 0.000000000000000000e+00)
(-4.750118570071658608e-01 4.901960784313708075e-03 0.000000000000000000e+00)
(-4.751066455926241661e-01 1.470588235294117974e-02 0.000000000000000000e+00)
(-4.752958631979685156e-01 2.450980392156865140e-02 0.000000000000000000e+00)
(-4.755787920560100024e-01 3.431372549019606755e-02 0.000000000000000000e+00)
(-4.759543589206794989e-01 4.411764705882353921e-02 0.000000000000000000e+00)
(-4.764211391382180416e-01 5.392156862745095536e-02 0.000000000000000000e+00)
(-4.769773620513761414e-01 6.372549019607842702e-02 0.000000000000000000e+00)
(-4.776209177161234165e-01 7.352941176470589868e-02 0.000000000000000000e+00)
(-4.783493649053890406e-01 8.333333333333331483e-02 0.000000000000000000e+00)
(-4.791599403694720150e-01 9.313725490196078649e-02 0.000000000000000000e+00)
(-4.800495693179940293e-01 1.029411764705882026e-01 0.000000000000000000e+00)
(-4.810148770836323306e-01 1.127450980392156743e-01 0.000000000000000000e+00)
(-4.820522019233889344e-01 1.225490196078431460e-01 0.000000000000000000e+00)
(-4.831576089088360781e-01 1.323529411764705621e-01 0.000000000000000000e+00)
(-4.843269048526473441e-01 1.421568627450980338e-01 0.000000000000000000e+00)
(-4.855556542147937416e-01 1.519607843137255054e-01 0.000000000000000000e+00)
(-4.868391959280661263e-01 1.617647058823529216e-01 0.000000000000000000e+00)
(-4.881726610790997345e-01 1.715686274509803932e-01 0.000000000000000000e+00)
(-4.895509913778304245e-01 1.813725490196078649e-01 0.000000000000000000e+00)
(-4.909689583453211714e-01 1.911764705882352811e-01 0.000000000000000000e+00)
(-4.924211831471739242e-01 2.009803921568627527e-01 0.000000000000000000e+00)
(-4.939021569972905645e-01 2.107843137254901689e-01 0.000000000000000000e+00)
(-4.954062620545857110e-01 2.205882352941176405e-01 0.000000000000000000e+00)
(-4.969277927333821676e-01 2.303921568627451122e-01 0.000000000000000000e+00)
(-4.984609773466514016e-01 2.401960784313725283e-01 0.000000000000000000e+00)
)
spline 4 7
(
(-4.984609773466514016e-01 -2.401960784313725561e-01 1.000000000000000021e-02)
(-4.969277927333821676e-01 -2.303921568627451122e-01 1.000000000000000021e-02)
(-4.954062620545857110e-01 -2.205882352941176405e-01 1.000000000000000021e-02)
(-4.939021569972905645e-01 -2.107843137254901966e-01 1.000000000000000021e-02)
(-4.924211831471739242e-01 -2.009803921568627527e-01 1.000000000000000021e-02)
(-4.909689583453211714e-01 -1.911764705882352811e-01 1.000000000000000021e-02)
(-4.895509913778304245e-01 -1.813725490196078372e-01 1.000000000000000021e-02)
(-4.881726610790997345e-01 -1.715686274509803932e-01 1.000000000000000021e-02)
(-4.868391959280661263e-01 -1.617647058823529493e-01 1.000000000000000021e-02)
(-4.855556542147937416e-01 -1.519607843137255054e-01 1.000000000000000021e-02)
(-4.843269048526473441e-01 -1.421568627450980338e-01 1.000000000000000021e-02)
(-4.831576089088360781e-01 -1.323529411764705899e-01 1.000000000000000021e-02)
(-4.820522019233889344e-01 -1.225490196078431460e-01 1.000000000000000021e-02)
(-4.810148770836323306e-01 -1.127450980392156743e-01 1.000000000000000021e-02)
(-4.800495693179940293e-01 -1.029411764705882304e-01 1.000000000000000021e-02)
(-4.791599403694720150e-01 -9.313725490196078649e-02 1.000000000000000021e-02)
(-4.783493649053890406e-01 -8.333333333333334259e-02 1.000000000000000021e-02)
(-4.776209177161234165e-01 -7.352941176470589868e-02 1.000000000000000021e-02)
(-4.769773620513761414e-01 -6.372549019607842702e-02 1.000000000000000021e-02)
(-4.764211391382180416e-01 -5.392156862745098311e-02 1.000000000000000021e-02)
(-4.759543589206794989e-01 -4.411764705882353921e-02 1.000000000000000021e-02)
(-4.755787920560100024e-01 -3.431372549019606755e-02 1.000000000000000021e-02)
(-4.752958631979685156e-01 -2.450980392156862364e-02 1.000000000000000021e-02)
(-4.751066455926241661e-01 -1.470588235294117974e-02 1.000000000000000021e-02)
(-4.750118570071658608e-01 -4.901960784313735831e-03 1.000000000000000021e-02)
(-4.750118570071658608e-01 4.901960784313708075e-03 1.000000000000000021e-02)
(-4.751066455926241661e-01 1.470588235294117974e-02 1.000000000000000021e-02)
(-4.752958631979685156e-01 2.450980392156865140e-02 1.000000000000000021e-02)
(-4.755787920560100024e-01 3.431372549019606755e-02 1.000000000000000021e-02)
(-4.759543589206794989e-01 4.411764705882353921e-02 1.000000000000000021e-02)
(-4.764211391382180416e-01 5.392156862745095536e-02 1.000000000000000021e-02)
(-4.769773620513761414e-01 6.372549019607842702e-02 1.000000000000000021e-02)
(-4.776209177161234165e-01 7.352941176470589868e-02 1.000000000000000021e-02)
(-4.783493649053890406e-01 8.333333333333331483e-02 1.000000000000000021e-02)
(-4.791599403694720150e-01 9.313725490196078649e-02 1.000000000000000021e-02)
(-4.800495693179940293e-01 1.029411764705882026e-01 1.000000000000000021e-02)
(-4.810148770836323306e-01 1.127450980392156743e-01 1.000000000000000021e-02)
(-4.820522019233889344e-01 1.225490196078431460e-01 1.000000000000000021e-02)
(-4.831576089088360781e-01 1.323529411764705621e-01 1.000000000000000021e-02)
(-4.843269048526473441e-01 1.421568627450980338e-01 1.000000000000000021e-02)
(-4.855556542147937416e-01 1.519607843137255054e-01 1.000000000000000021e-02)
(-4.868391959280661263e-01 1.617647058823529216e-01 1.000000000000000021e-02)
(-4.881726610790997345e-01 1.715686274509803932e-01 1.000000000000000021e-02)
(-4.895509913778304245e-01 1.813725490196078649e-01 1.000000000000000021e-02)
(-4.909689583453211714e-01 1.911764705882352811e-01 1.000000000000000021e-02)
(-4.924211831471739242e-01 2.009803921568627527e-01 1.000000000000000021e-02)
(-4.939021569972905645e-01 2.107843137254901689e-01 1.000000000000000021e-02)
(-4.954062620545857110e-01 2.205882352941176405e-01 1.000000000000000021e-02)
(-4.969277927333821676e-01 2.303921568627451122e-01 1.000000000000000021e-02)
(-4.984609773466514016e-01 2.401960784313725283e-01 1.000000000000000021e-02)
)
spline 1 2
(
(4.984609773466514016e-01 -2.401960784313725561e-01 0.000000000000000000e+00)
(4.969277927333821676e-01 -2.303921568627451122e-01 0.000000000000000000e+00)
(4.954062620545857110e-01 -2.205882352941176405e-01 0.000000000000000000e+00)
(4.939021569972905645e-01 -2.107843137254901966e-01 0.000000000000000000e+00)
(4.924211831471739242e-01 -2.009803921568627527e-01 0.000000000000000000e+00)
(4.909689583453211714e-01 -1.911764705882352811e-01 0.000000000000000000e+00)
(4.895509913778304245e-01 -1.813725490196078372e-01 0.000000000000000000e+00)
(4.881726610790997345e-01 -1.715686274509803932e-01 0.000000000000000000e+00)
(4.868391959280661263e-01 -1.617647058823529493e-01 0.000000000000000000e+00)
(4.855556542147937416e-01 -1.519607843137255054e-01 0.000000000000000000e+00)
(4.843269048526473441e-01 -1.421568627450980338e-01 0.000000000000000000e+00)
(4.831576089088360781e-01 -1.323529411764705899e-01 0.000000000000000000e+00)
(4.820522019233889344e-01 -1.225490196078431460e-01 0.000000000000000000e+00)
(4.810148770836323306e-01 -1.127450980392156743e-01 0.000000000000000000e+00)
(4.800495693179940293e-01 -1.029411764705882304e-01 0.000000000000000000e+00)
(4.791599403694720150e-01 -9.313725490196078649e-02 0.000000000000000000e+00)
(4.783493649053890406e-01 -8.333333333333334259e-02 0.000000000000000000e+00)
(4.776209177161234165e-01 -7.352941176470589868e-02 0.000000000000000000e+00)
(4.769773620513761414e-01 -6.372549019607842702e-02 0.000000000000000000e+00)
(4.764211391382180416e-01 -5.392156862745098311e-02 0.000000000000000000e+00)
(4.759543589206794989e-01 -4.411764705882353921e-02 0.000000000000000000e+00)
(4.755787920560100024e-01 -3.431372549019606755e-02 0.000000000000000000e+00)
(4.752958631979685156e-01 -2.450980392156862364e-02 0.000000000000000000e+00)
(4.751066455926241661e-01 -1.470588235294117974e-02 0.000000000000000000e+00)
(4.750118570071658608e-01 -4.901960784313735831e-03 0.000000000000000000e+00)
(4.750118570071658608e-01 4.901960784313708075e-03 0.000000000000000000e+00)
(4.751066455926241661e-01 1.470588235294117974e-02 0.000000000000000000e+00)
(4.752958631979685156e-01 2.450980392156865140e-02 0.000000000000000000e+00)
(4.755787920560100024e-01 3.431372549019606755e-02 0.000000000000000000e+00)
(4.759543589206794989e-01 4.411764705882353921e-02 0.000000000000000000e+00)
(4.764211391382180416e-01 5.392156862745095536e-02 0.000000000000000000e+00)
(4.769773620513761414e-01 6.372549019607842702e-02 0.000000000000000000e+00)
(4.776209177161234165e-01 7.352941176470589868e-02 0.000000000000000000e+00)
(4.783493649053890406e-01 8.333333333333331483e-02 0.000000000000000000e+00)
(4.791599403694720150e-01 9.313725490196078649e-02 0.000000000000000000e+00)
(4.800495693179940293e-01 1.029411764705882026e-01 0.000000000000000000e+00)
(4.810148770836323306e-01 1.127450980392156743e-01 0.000000000000000000e+00)
(4.820522019233889344e-01 1.225490196078431460e-01 0.000000000000000000e+00)
(4.831576089088360781e-01 1.323529411764705621e-01 0.000000000000000000e+00)
(4.843269048526473441e-01 1.421568627450980338e-01 0.000000000000000000e+00)
(4.855556542147937416e-01 1.519607843137255054e-01 0.000000000000000000e+00)
(4.868391959280661263e-01 1.617647058823529216e-01 0.000000000000000000e+00)
(4.881726610790997345e-01 1.715686274509803932e-01 0.000000000000000000e+00)
(4.895509913778304245e-01 1.813725490196078649e-01 0.000000000000000000e+00)
(4.909689583453211714e-01 1.911764705882352811e-01 0.000000000000000000e+00)
(4.924211831471739242e-01 2.009803921568627527e-01 0.000000000000000000e+00)
(4.939021569972905645e-01 2.107843137254901689e-01 0.000000000000000000e+00)
(4.954062620545857110e-01 2.205882352941176405e-01 0.000000000000000000e+00)
(4.969277927333821676e-01 2.303921568627451122e-01 0.000000000000000000e+00)
(4.984609773466514016e-01 2.401960784313725283e-01 0.000000000000000000e+00)
)
spline 5 6
(
(4.984609773466514016e-01 -2.401960784313725561e-01 1.000000000000000021e-02)
(4.969277927333821676e-01 -2.303921568627451122e-01 1.000000000000000021e-02)
(4.954062620545857110e-01 -2.205882352941176405e-01 1.000000000000000021e-02)
(4.939021569972905645e-01 -2.107843137254901966e-01 1.000000000000000021e-02)
(4.924211831471739242e-01 -2.009803921568627527e-01 1.000000000000000021e-02)
(4.909689583453211714e-01 -1.911764705882352811e-01 1.000000000000000021e-02)
(4.895509913778304245e-01 -1.813725490196078372e-01 1.000000000000000021e-02)
(4.881726610790997345e-01 -1.715686274509803932e-01 1.000000000000000021e-02)
(4.868391959280661263e-01 -1.617647058823529493e-01 1.000000000000000021e-02)
(4.855556542147937416e-01 -1.519607843137255054e-01 1.000000000000000021e-02)
(4.843269048526473441e-01 -1.421568627450980338e-01 1.000000000000000021e-02)
(4.831576089088360781e-01 -1.323529411764705899e-01 1.000000000000000021e-02)
(4.820522019233889344e-01 -1.225490196078431460e-01 1.000000000000000021e-02)
(4.810148770836323306e-01 -1.127450980392156743e-01 1.000000000000000021e-02)
(4.800495693179940293e-01 -1.029411764705882304e-01 1.000000000000000021e-02)
(4.791599403694720150e-01 -9.313725490196078649e-02 1.000000000000000021e-02)
(4.783493649053890406e-01 -8.333333333333334259e-02 1.000000000000000021e-02)
(4.776209177161234165e-01 -7.352941176470589868e-02 1.000000000000000021e-02)
(4.769773620513761414e-01 -6.372549019607842702e-02 1.000000000000000021e-02)
(4.764211391382180416e-01 -5.392156862745098311e-02 1.000000000000000021e-02)
(4.759543589206794989e-01 -4.411764705882353921e-02 1.000000000000000021e-02)
(4.755787920560100024e-01 -3.431372549019606755e-02 1.000000000000000021e-02)
(4.752958631979685156e-01 -2.450980392156862364e-02 1.000000000000000021e-02)
(4.751066455926241661e-01 -1.470588235294117974e-02 1.000000000000000021e-02)
(4.750118570071658608e-01 -4.901960784313735831e-03 1.000000000000000021e-02)
(4.750118570071658608e-01 4.901960784313708075e-03 1.000000000000000021e-02)
(4.751066455926241661e-01 1.470588235294117974e-02 1.000000000000000021e-02)
(4.752958631979685156e-01 2.450980392156865140e-02 1.000000000000000021e-02)
(4.755787920560100024e-01 3.431372549019606755e-02 1.000000000000000021e-02)
(4.759543589206794989e-01 4.411764705882353921e-02 1.000000000000000021e-02)
(4.764211391382180416e-01 5.392156862745095536e-02 1.000000000000000021e-02)
(4.769773620513761414e-01 6.372549019607842702e-02 1.000000000000000021e-02)
(4.776209177161234165e-01 7.352941176470589868e-02 1.000000000000000021e-02)
(4.783493649053890406e-01 8.333333333333331483e-02 1.000000000000000021e-02)
(4.791599403694720150e-01 9.313725490196078649e-02 1.000000000000000021e-02)
(4.800495693179940293e-01 1.029411764705882026e-01 1.000000000000000021e-02)
(4.810148770836323306e-01 1.127450980392156743e-01 1.000000000000000021e-02)
(4.820522019233889344e-01 1.225490196078431460e-01 1.000000000000000021e-02)
(4.831576089088360781e-01 1.323529411764705621e-01 1.000000000000000021e-02)
(4.843269048526473441e-01 1.421568627450980338e-01 1.000000000000000021e-02)
(4.855556542147937416e-01 1.519607843137255054e-01 1.000000000000000021e-02)
(4.868391959280661263e-01 1.617647058823529216e-01 1.000000000000000021e-02)
(4.881726610790997345e-01 1.715686274509803932e-01 1.000000000000000021e-02)
(4.895509913778304245e-01 1.813725490196078649e-01 1.000000000000000021e-02)
(4.909689583453211714e-01 1.911764705882352811e-01 1.000000000000000021e-02)
(4.924211831471739242e-01 2.009803921568627527e-01 1.000000000000000021e-02)
(4.939021569972905645e-01 2.107843137254901689e-01 1.000000000000000021e-02)
(4.954062620545857110e-01 2.205882352941176405e-01 1.000000000000000021e-02)
(4.969277927333821676e-01 2.303921568627451122e-01 1.000000000000000021e-02)
(4.984609773466514016e-01 2.401960784313725283e-01 1.000000000000000021e-02)
)
);




boundary
(
    left
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    right
    {
    	type patch;
    	faces
    	(
    		(2 6 5 1)
    	);
    }

    up
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    down
    {
        type patch;
        faces
        (
            //(0 4 7 3)
            //(2 6 5 1)
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);