phygeonet-master/case3/TemplateCase0.025/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
2500
(
(-0.489236 -0.245033 0.005)
(-0.469267 -0.245033 0.005)
(-0.449298 -0.245033 0.005)
(-0.429329 -0.245033 0.005)
(-0.409361 -0.245033 0.005)
(-0.389392 -0.245033 0.005)
(-0.369423 -0.245033 0.005)
(-0.349454 -0.245033 0.005)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.49922 -0.24503 0.005)
(-0.497663 -0.23509 0.005)
(-0.496114 -0.225148 0.005)
(-0.49458 -0.215205 0.005)
(-0.493068 -0.205258 0.005)
(-0.491581 -0.195307 0.005)
(-0.490127 -0.185351 0.005)
(-0.48871 -0.17539 0.005)
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(0.49922 -0.24503 0.005)
(0.497663 -0.23509 0.005)
(0.496114 -0.225148 0.005)
(0.49458 -0.215205 0.005)
(0.493068 -0.205258 0.005)
(0.491581 -0.195307 0.005)
(0.490127 -0.185351 0.005)
(0.48871 -0.17539 0.005)
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.49 0.25 0.005)
(-0.47 0.25 0.005)
(-0.45 0.25 0.005)
(-0.43 0.25 0.005)
(-0.41 0.25 0.005)
(-0.39 0.25 0.005)
(-0.37 0.25 0.005)
(-0.35 0.25 0.005)
...
)
;
    }
    down
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(-0.49 -0.25 0.005)
(-0.47 -0.25 0.005)
(-0.45 -0.25 0.005)
(-0.43 -0.25 0.005)
(-0.41 -0.25 0.005)
(-0.39 -0.25 0.005)
(-0.37 -0.25 0.005)
(-0.35 -0.25 0.005)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
